{
  "componentName": "oak-checkbox",
  "composerName": "-",
  "sections": [
    {
      "body": "Checkbox is a square box with text adjacent to it. The user is given the option to tick one or more checkboxes. There are diverse customizations provided by OakUI in the Checkbox component which are available to the users for customizing the UI components as per their requirement."
    },
    {
      "heading": "Styling",
      "body": "Styling brings cohesion to the Checkbox component with all the properties available with OakUI tools. Each configuration in these tools allows the user to display a variety of checkbox fields as the end-user desires. Each customization feature in styling has alternatives available for the end-user to decide upon. The user can make use of these tools of colors and shapes to equip the ideal design."
    },
    {
      "heading": "Validation",
      "body": "A Validator Function is a customizable tool, which is essentially used to validate the entered data and communicate with the backend database for further validations if there aren’t any cross-validations i.e., validating information in one checkbox component against validating information in another. "
    },
    {
      "body": "Customization of Validator Function has no limitations. It can be designed as per the requirement of the end-user. "
    },
    {
      "body": "Consider two various examples of validation. When the form is made to select courses, and it has a component entitled “Select course” with multiple course options available to choose by ticking the checkboxes. If the end-user chooses, course1 and course2, then a few other components consisting of specialization course or collage name automatically get displayed below this component for the end-user to choose or fill."
    },
    {
      "body": "Another example case being gender selection, if the end-user selects the gender from the checkbox and when another component requires the information of the gender, then this component communicates with the database to get information of the gender selection component to autofill the current component."
    },
    {
      "heading": "Minimum and Maximum Length",
      "body": "It defines the number of checkboxes that can be ticked from the given checkbox options. If the condition is not satisfied, then it displays an error message."
    },
    {
      "heading": "Native Support",
      "body": "Native Support is provided by OakUI, being a distinct feature, it enables characteristics such as, the Checkbox to get embedded into the format of the device that is being used. The look and feel of the component would feel no different from the other components we see in the end-user's device."
    },
    {
      "heading": "Accessibility",
      "body": "Accessibility is the specifications of how the user can access the checkbox. When the cursor is set on one of the checkbox components, there is an indication implying that the user can tick the checkbox. For the same, it shows a highlighted effect."
    },
    {
      "body": "It also includes custom-built accessibility features for end-users with visual impairment. The usage of \"tab\" is significant here, we could go from one checkbox to another just with one click of the tab button. This feature enables the user to directly access the component instead of using the cursor. Once the component is accessed, the end-user can tick the checkbox using the space bar. On clicking the tab button furthermore, the access goes from the first checkbox to the next for the user to tick it."
    }
  ]
}
